DataProcessors/ПерерасчетЗарплатыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПерерасчетЗарплатыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокРаботников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботникНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПодразделений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатУпр</Name>
					<Comment>в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДнейЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаДнейЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЧасовЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеУпр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремениДляСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремениДляСредней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаВидРасчета</Name>
					<Comment>если не заполнен, значи это не замена</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаКоличествоСтавок</Name>
					<Comment>если не заполнен, значи это не замена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДополнительныеДанные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаменыОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыИОдноразовыеВыплатыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаписейРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Comment>Это либо Сотрудник, либо Внутренний совместитель, либо Сотрудник которого Заменяем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Enums/ВидыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Раздел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВажнаяИнформация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПерерасчетЗарплатыОрганизаций/Ext/ObjectModule.bsl
Перем мПодразделенияДокументы Экспорт;  // соответствие подразделений и документов перерасчета
Перем мРаботникиДокументы Экспорт; // соответствие работников и документов перерасчета

Функция СформироватьЗапрос(Организации = Неопределено, ТекущийПериодРегистрации = Неопределено, СписокПомеченныхДокументов = Неопределено, МаксимальноеКоличествоСобытий = 0) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекущийПериодРегистрации) Тогда
		ТекущийПериодРегистрации = НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату())
	КонецЕсли;	
	
	ТекстПервыхЗаписей = ?(МаксимальноеКоличествоСобытий = 0, "", " ПЕРВЫЕ " + МаксимальноеКоличествоСобытий);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТекущийПериод",				ТекущийПериодРегистрации);
	Запрос.УстановитьПараметр("СписокПомеченныхДокументов",	СписокПомеченныхДокументов);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям",			Не ЗначениеЗаполнено(Организации));
	Запрос.УстановитьПараметр("Организация",				Организации);
	
	// документы к перерасчету без отборов по периоду начисления и организации
	// ВТДокументыКПерерасчету
	Если Истина Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПерерасчетНачислений.ОбъектПерерасчета КАК Документ
		|ПОМЕСТИТЬ ВТДокументыКПерерасчету
		|ИЗ
		|	РегистрРасчета.Начисления.ПерерасчетНачислений КАК ПерерасчетНачислений
		|ГДЕ
		|	(&ПоВсемОрганизациям
		|			ИЛИ ПерерасчетНачислений.Организация В (&Организация))
		|	И (НЕ ПерерасчетНачислений.ОбъектПерерасчета ССЫЛКА Документ.Сторнирование)
		|
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПерерасчетВзносовВФонды.ОбъектПерерасчета
		|ИЗ
		|	РегистрРасчета.ВзносыВФонды.ПерерасчетВзносовВФонды КАК ПерерасчетВзносовВФонды
		|ГДЕ
		|	(&ПоВсемОрганизациям
		|			ИЛИ ПерерасчетВзносовВФонды.Организация В (&Организация))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПерерасчетСреднегоЗаработка.ОбъектПерерасчета
		|ИЗ
		|	РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК ПерерасчетСреднегоЗаработка
		|ГДЕ
		|	(&ПоВсемОрганизациям
		|			ИЛИ ПерерасчетСреднегоЗаработка.Организация В (&Организация))
		|
		|";
		Запрос.Выполнить();
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДокументыКПерерасчету";
	
	// однострочные документы к перерасчету предыдущих периодов с отбором по организации без исправленных документов (которых пересчитывать уже нельзя)
	// ВТНачислениеОтпуска
	Если Истина Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	НачислениеОтпускаРаботникамОрганизаций.Ссылка КАК Документ,
		|	НачислениеОтпускаРаботникамОрганизаций.ПериодРегистрации,
		|	НачислениеОтпускаРаботникамОрганизаций.Организация
		|ПОМЕСТИТЬ ВТНачислениеОтпуска
		|ИЗ
		|	Документ.НачислениеОтпускаРаботникамОрганизаций КАК НачислениеОтпускаРаботникамОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеОтпускаРаботникамОрганизаций КАК Исправления
		|		ПО НачислениеОтпускаРаботникамОрганизаций.Ссылка = Исправления.ПерерассчитываемыйДокумент
		|ГДЕ
		|	НачислениеОтпускаРаботникамОрганизаций.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И (&ПоВсемОрганизациям
		|			ИЛИ НачислениеОтпускаРаботникамОрганизаций.Организация В (&Организация))
		|	И НачислениеОтпускаРаботникамОрганизаций.ПериодРегистрации <= &ТекущийПериод
		|	И Исправления.Ссылка ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНачислениеОтпуска";
	
	// ВТНачислениеПоБольничномуЛисту
	Если Истина Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	НачислениеПоБольничномуЛисту.Ссылка КАК Документ,
		|	НачислениеПоБольничномуЛисту.ПериодРегистрации,
		|	НачислениеПоБольничномуЛисту.Организация
		|ПОМЕСТИТЬ ВТНачислениеПоБольничномуЛисту
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПоБольничномуЛисту КАК Исправления
		|		ПО НачислениеПоБольничномуЛисту.Ссылка = Исправления.ПерерассчитываемыйДокумент
		|ГДЕ
		|	НачислениеПоБольничномуЛисту.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И (&ПоВсемОрганизациям
		|			ИЛИ НачислениеПоБольничномуЛисту.Организация В (&Организация))
		|	И НачислениеПоБольничномуЛисту.ПериодРегистрации <= &ТекущийПериод
		|	И Исправления.Ссылка ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНачислениеПоБольничномуЛисту";
	
	// ВТОплатаПоСреднемуЗаработку
	Если Истина Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	ОплатаПоСреднемуЗаработку.Ссылка КАК Документ,
		|	ОплатаПоСреднемуЗаработку.ПериодРегистрации,
		|	ОплатаПоСреднемуЗаработку.Организация
		|ПОМЕСТИТЬ ВТОплатаПоСреднемуЗаработку
		|ИЗ
		|	Документ.ОплатаПоСреднемуЗаработку КАК ОплатаПоСреднемуЗаработку
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаПоСреднемуЗаработку КАК Исправления
		|		ПО ОплатаПоСреднемуЗаработку.Ссылка = Исправления.ПерерассчитываемыйДокумент
		|ГДЕ
		|	ОплатаПоСреднемуЗаработку.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И (&ПоВсемОрганизациям
		|			ИЛИ ОплатаПоСреднемуЗаработку.Организация В (&Организация))
		|	И ОплатаПоСреднемуЗаработку.ПериодРегистрации <= &ТекущийПериод
		|	И Исправления.Ссылка ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТОплатаПоСреднемуЗаработку";
	
	// документы к перерасчету предыдущих периодов с отбором по организации, но включая исправленные документы
	// ВТНачислениеЗарплаты
	Если Истина Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	НачислениеЗарплатыРаботникамОрганизаций.Ссылка КАК Документ,
		|	НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации КАК ПериодРегистрации,
		|	НачислениеЗарплатыРаботникамОрганизаций.Организация
		|ПОМЕСТИТЬ ВТНачислениеЗарплаты
		|ИЗ
		|	Документ.НачислениеЗарплатыРаботникамОрганизаций КАК НачислениеЗарплатыРаботникамОрганизаций
		|ГДЕ
		|	НачислениеЗарплатыРаботникамОрганизаций.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И (&ПоВсемОрганизациям
		|			ИЛИ НачислениеЗарплатыРаботникамОрганизаций.Организация В (&Организация))
		|	И НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации <= &ТекущийПериод
		|	И (НачислениеЗарплатыРаботникамОрганизаций.Проведен
		|			ИЛИ НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации = &ТекущийПериод)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ
		|";
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНачислениеЗарплаты";
	
	// ВТНевыходыИОдноразовыеВыплатыВОрганизациях
	Если Истина Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	НевыходыВОрганизациях.Ссылка КАК Документ,
		|	НевыходыВОрганизациях.ПериодРегистрации КАК ПериодРегистрации,
		|	НевыходыВОрганизациях.Организация
		|ПОМЕСТИТЬ ВТНевыходыИОдноразовыеВыплатыВОрганизациях
		|ИЗ
		|	Документ.НевыходыИОдноразовыеВыплатыВОрганизациях КАК НевыходыВОрганизациях
		|ГДЕ
		|	НевыходыВОрганизациях.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И (&ПоВсемОрганизациям
		|			ИЛИ НевыходыВОрганизациях.Организация В (&Организация))
		|	И НевыходыВОрганизациях.ПериодРегистрации <= &ТекущийПериод
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНевыходыИОдноразовыеВыплатыВОрганизациях";
	
	// документы-исправления выбранных ранее документов, нуждающихся в перерасчете - только многострочные
	// ВТДокументыИсправления
	Если Истина Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеЗарплатыРаботникамОрганизаций.Ссылка КАК Документ,
		|	НачислениеЗарплатыРаботникамОрганизаций.ПерерассчитываемыйДокумент КАК ИсходныйДокумент
		|ПОМЕСТИТЬ ВТДокументыИсправления
		|ИЗ
		|	Документ.НачислениеЗарплатыРаботникамОрганизаций КАК НачислениеЗарплатыРаботникамОрганизаций
		|ГДЕ
		|	НачислениеЗарплатыРаботникамОрганизаций.ПерерассчитываемыйДокумент В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТНачислениеЗарплаты КАК ДокументыКПерерасчету)
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	НевыходыВОрганизациях.Ссылка,
		|	НевыходыВОрганизациях.ПерерассчитываемыйДокумент
		|ИЗ
		|	Документ.НевыходыИОдноразовыеВыплатыВОрганизациях КАК НевыходыВОрганизациях
		|ГДЕ
		|	НевыходыВОрганизациях.ПерерассчитываемыйДокумент В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТНевыходыИОдноразовыеВыплатыВОрганизациях КАК ДокументыКПерерасчету)
		|";
	КонецЕсли;
	
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество = 0 Тогда // все многострочные документы оказались неисправленными, лишние запросы исполнять не будем 
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.ПериодРегистрации КАК ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Пометка,
		|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ) КАК Наименование,
		|	ДокументыПерерасчета.Организация.Наименование КАК НаименованиеОрганизации,
		|	ДокументыПерерасчета.Документ КАК Ссылка,
		|	ДокументыПерерасчета.Организация
		|ИЗ
		|	ВТНачислениеОтпуска КАК ДокументыПерерасчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
		|	ДокументыПерерасчета.Организация.Наименование,
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.Организация
		|ИЗ
		|	ВТНачислениеПоБольничномуЛисту КАК ДокументыПерерасчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
		|	ДокументыПерерасчета.Организация.Наименование,
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.Организация
		|ИЗ
		|	ВТОплатаПоСреднемуЗаработку КАК ДокументыПерерасчета
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
		|	ДокументыПерерасчета.Организация.Наименование,
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.Организация
		|ИЗ
		|	ВТНачислениеЗарплаты КАК ДокументыПерерасчета
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
		|	ДокументыПерерасчета.Организация.Наименование,
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.Организация
		|ИЗ
		|	ВТНевыходыИОдноразовыеВыплатыВОрганизациях КАК ДокументыПерерасчета
		|
		|
		|";
		
	Иначе
		
		// ВТДокументыПерерасчетаСИсправленными
		Если Истина Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ КАК Документ,
			|	ДокументыПерерасчета.ПериодРегистрации КАК ПериодРегистрации,
			|	ДокументыПерерасчета.Организация
			|ПОМЕСТИТЬ ВТДокументыПерерасчетаСИсправленными
			|ИЗ
			|	ВТНачислениеЗарплаты КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ДокументыПерерасчета.Организация
			|ИЗ ВТНачислениеПоБольничномуЛисту КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ДокументыПерерасчета.Организация
			|ИЗ ВТОплатаПоСреднемуЗаработку КАК ДокументыПерерасчета
			|";
			Запрос.Выполнить();
		КонецЕсли;
		
		// Сотрудники, чьи результаты расчетов устарели
		// ВТСотрудникиПерерасчета
		Если Истина Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НачисленияПерерасчетНачислений.Сотрудник КАК Сотрудник,
			|	НачисленияПерерасчетНачислений.ОбъектПерерасчета КАК Ссылка
			|ПОМЕСТИТЬ ВТСотрудникиПерерасчета
			|ИЗ РегистрРасчета.Начисления.ПерерасчетНачислений КАК НачисленияПерерасчетНачислений
			|ГДЕ НачисленияПерерасчетНачислений.ОбъектПерерасчета В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ ВТДокументыПерерасчетаСИсправленными КАК ДокументыКПерерасчету)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	ПерерасчетВзносовВФонды.Сотрудник,
			|	ПерерасчетВзносовВФонды.ОбъектПерерасчета
			|ИЗ
			|	РегистрРасчета.ВзносыВФонды.ПерерасчетВзносовВФонды КАК ПерерасчетВзносовВФонды
			|ГДЕ
			|	ПерерасчетВзносовВФонды.ОбъектПерерасчета В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыПерерасчетаСИсправленными КАК ДокументыКПерерасчету)
			|
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка.Сотрудник,
			|	РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка.ОбъектПерерасчета
			|ИЗ
			|	РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка
			|ГДЕ
			|	РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка.ОбъектПерерасчета В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыПерерасчетаСИсправленными КАК ДокументыКПерерасчету)
			|
			|";
			Запрос.Выполнить();
		КонецЕсли;
		
		// физлица, чьи результаты расчетов уже исправляли, 
		// содержащие только таких сотрудников документы не предлагаем к перерасчету
		// ВТФизлицаИсправлений
		Если Истина Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДокументыИсправления.ИсходныйДокумент КАК Ссылка,
			|	НачислениеЗарплатыРаботникамОрганизацийНачисления.Сотрудник КАК Сотрудник
			|ПОМЕСТИТЬ ВТФизлицаИсправлений
			|ИЗ
			|	Документ.НачислениеЗарплатыРаботникамОрганизаций.Начисления КАК НачислениеЗарплатыРаботникамОрганизацийНачисления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыИсправления КАК ДокументыИсправления
			|		ПО НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка = ДокументыИсправления.Документ
			|			И НачислениеЗарплатыРаботникамОрганизацийНачисления.СторнируемыйДокумент = ДокументыИсправления.ИсходныйДокумент
			|ГДЕ
			|	НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыИсправления КАК ДокументыКПерерасчету
			|			ГДЕ
			|				ДокументыКПерерасчету.Документ ССЫЛКА Документ.НачислениеЗарплатыРаботникамОрганизаций)
			|	И НачислениеЗарплатыРаботникамОрганизацийНачисления.Сторно
			|
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыИсправления.ИсходныйДокумент,
			|	НевыходыВОрганизацияхНачисления.Сотрудник
			|ИЗ
			|	Документ.НевыходыИОдноразовыеВыплатыВОрганизациях.Начисления КАК НевыходыВОрганизацияхНачисления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыИсправления КАК ДокументыИсправления
			|		ПО НевыходыВОрганизацияхНачисления.Ссылка = ДокументыИсправления.Документ
			|			И НевыходыВОрганизацияхНачисления.СторнируемыйДокумент = ДокументыИсправления.ИсходныйДокумент
			|ГДЕ
			|	НевыходыВОрганизацияхНачисления.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыИсправления КАК ДокументыКПерерасчету
			|			ГДЕ
			|				ДокументыКПерерасчету.Документ ССЫЛКА Документ.НевыходыИОдноразовыеВыплатыВОрганизациях)
			|	И НевыходыВОрганизацияхНачисления.Сторно
			|";
			Запрос.Выполнить();
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.ПериодРегистрации КАК ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Пометка,
		|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ) КАК Наименование,
		|	ДокументыПерерасчета.Организация.Наименование КАК НаименованиеОрганизации,
		|	ДокументыПерерасчета.Документ КАК Ссылка,
		|	ДокументыПерерасчета.Организация
		|ИЗ
		|	ВТНачислениеОтпуска КАК ДокументыПерерасчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
		|	ДокументыПерерасчета.Организация.Наименование,
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.Организация
		|ИЗ
		|	ВТНачислениеПоБольничномуЛисту КАК ДокументыПерерасчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
		|	ДокументыПерерасчета.Организация.Наименование,
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.Организация
		|ИЗ
		|	ВТОплатаПоСреднемуЗаработку КАК ДокументыПерерасчета
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ " + ТекстПервыхЗаписей + "
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
		|	ДокументыПерерасчета.Организация.Наименование,
		|	ДокументыПерерасчета.Документ,
		|	ДокументыПерерасчета.Организация
		|ИЗ
		|	ВТДокументыПерерасчетаСИсправленными КАК ДокументыПерерасчета
		|ГДЕ
		|	ДокументыПерерасчета.Документ В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				Документы.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТСотрудникиПерерасчета КАК Документы 
		|					ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаИсправлений КАК ДокументыИсправления
		|					ПО Документы.Ссылка = ДокументыИсправления.Ссылка
		|						И Документы.Сотрудник = ДокументыИсправления.Сотрудник
		|			ГДЕ
		|				ДокументыИсправления.Сотрудник ЕСТЬ NULL )
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодРегистрации";
		
	КонецЕсли;

	Возврат Запрос.Выполнить()
	
КонецФункции // СформироватьЗапрос()

// Заполняет список физлиц по которым необходимо пересчитать зарплату по заданной организации
// Параметры: 
//	Организация - ссылка на организацию
// Возвращаемое значение:
//	Нет
//
Процедура ЗаполнитьДанныеПоОрганизации() Экспорт
	
	мПодразделенияДокументы.Очистить();
	мРаботникиДокументы.Очистить();
	
	СписокПодразделений.Очистить();
	СписокРаботников.Очистить();
	
	// пока не выбрана организация ничего не делаем
	Если Организация.Пустая() Тогда
		СписокДокументов.Очистить();
		Возврат;
	КонецЕсли;
	
	//запомним какие документы отмечены в списке документов
	ТаблицаДокументов = СписокДокументов.Выгрузить();
	МассивСтрок = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка", Истина));
	СписокПомеченныхДокументов = ТаблицаДокументов.Скопировать(МассивСтрок).ВыгрузитьКолонку("Документ");
	
	Результат = СформироватьЗапрос(Организация, ТекущийПериод, СписокПомеченныхДокументов);
	
	ТЗ = Результат.Выгрузить();
	ТЗ.Свернуть("Пометка, Документ, ПериодРегистрации"); 
	СписокДокументов.Загрузить(ТЗ);
	
КонецПроцедуры

// перерассчитать помеченные документы, в порядке от самого старого до самого нового.
// перебираются все документы (объекты перерасчета) и для них вызывается стандартная процедура  
//
// Возвращаемое значение:
//	Нет
Процедура Перерассчитать() Экспорт
	
	Заголовок = ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='Перерасчет документов';uk='Перерахунок документів'"));
	ИндексСтрокиТаблицы = СписокДокументов.Количество();
	Пока ИндексСтрокиТаблицы > 0 Цикл
		ИндексСтрокиТаблицы = ИндексСтрокиТаблицы - 1;
		
		СтрокаТаблицы = СписокДокументов[ИндексСтрокиТаблицы];
		Если СтрокаТаблицы.Пометка Тогда
			
			// проверим можно ли что-то делать с документом
			ОписаниеПричиныОтказа = "";
			Если ПроведениеРасчетов.ДокументНельзяИзменятьЗаднимЧислом(СтрокаТаблицы.Документ, ОписаниеПричиныОтказа) Тогда
				ПроведениеРасчетов.КомментарийРасчета(СтрЗаменить(ОписаниеПричиныОтказа,НСтр("ru='Документ ';uk='Документ '"),Строка(СтрокаТаблицы.Документ)), , "Открыть", СтрокаТаблицы.Документ,Перечисления.ВидыСообщений.ВажнаяИнформация);
				Продолжить;	
			КонецЕсли;
			
			ДокументОбъект = СтрокаТаблицы.Документ.ПолучитьОбъект();
			
			Попытка
				ДокументОбъект.Перерассчитать();
				ПроведениеРасчетов.КомментарийРасчета(Строка(ДокументОбъект) + НСтр("ru=' обработан успешно. ';uk=' оброблений успішно. '"), Заголовок, "Открыть", СтрокаТаблицы.Документ);
			Исключение
				ПроведениеРасчетов.КомментарийРасчета("Документ " + Строка(ДокументОбъект) + НСтр("ru=' не может быть перерассчитан!"
"';uk=' не може бути перерозрахований!"
"'") + ОписаниеОшибки(), , "Открыть", СтрокаТаблицы.Документ,Перечисления.ВидыСообщений.ВажнаяИнформация);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьДанныеПоОрганизации();
	
КонецПроцедуры

// удалить сведения о перерасчете помеченных документов
Процедура УдалитьСведенияОПерерасчете() Экспорт
	
	Для Каждого СтрокаТаблицы Из СписокДокументов.НайтиСтроки(Новый Структура("Пометка", Истина)) Цикл
		ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(СтрокаТаблицы.Документ);
		ПроведениеРасчетов.УдалитьСведенияОПерезаполненииДокумента(СтрокаТаблицы.Документ);
	КонецЦикла;
	
	ЗаполнитьДанныеПоОрганизации();
	
КонецПроцедуры

// заполняет табличную часть СписокПодразделений и соответствие мПодразделенияДокументы 
// предназначенные для выполнения команды "отметить по подразделениеям"
Процедура ЗаполнитьСписокПодразделений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТекущийПериод", ТекущийПериод);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	// ВТСписокСотрудников
	Если Истина Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Перерасчет.Сотрудник КАК Сотрудник,
		|	Перерасчет.ОбъектПерерасчета КАК Документ
		|ПОМЕСТИТЬ ВТСписокСотрудников
		|ИЗ
		|	РегистрРасчета.Начисления.ПерерасчетНачислений КАК Перерасчет
		|ГДЕ
		|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
		|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
		|
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Перерасчет.Сотрудник,
		|	Перерасчет.ОбъектПерерасчета КАК Документ
		|ИЗ
		|	РегистрРасчета.ВзносыВФонды.ПерерасчетВзносовВФонды КАК Перерасчет
		|ГДЕ
		|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
		|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Перерасчет.Сотрудник,
		|	Перерасчет.ОбъектПерерасчета КАК Документ
		|ИЗ
		|	РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК Перерасчет
		|ГДЕ
		|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
		|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
		|
		|";
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Перерасчеты.Документ КАК Документ,
	|	Работники.ПодразделениеОрганизации.Наименование КАК ПодразделениеНаименование,
	|	Работники.ПодразделениеОрганизации КАК Подразделение
	|ИЗ ВТСписокСотрудников КАК Перерасчеты
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|   // Все неуволенные на конец месяца
	|	ВЫБРАТЬ
	|		РаботникиОрганизаций.Сотрудник,
	|		РаботникиОрганизаций.ПодразделениеОрганизации
	|	ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних( НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&ТекущийПериод, МЕСЯЦ), ДЕНЬ)
	|			, Организация = &Организация	
	|			И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСписокСотрудников)
	|      ) КАК РаботникиОрганизаций
	|	ГДЕ РаботникиОрганизаций.ЗанимаемыхСтавок > 0
	|
	|   // + уволенные за месяц
	|   ОБЪЕДИНИТЬ 
	|	ВЫБРАТЬ
	|		РаботникиОрганизаций.Сотрудник,
	|		РаботникиОрганизаций.ПодразделениеОрганизации
	|	ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|	ГДЕ РаботникиОрганизаций.ЗанимаемыхСтавок = 0
	|       И РаботникиОрганизаций.Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСписокСотрудников)
	|       И РаботникиОрганизаций.Организация = &Организация
	|       И НАЧАЛОПЕРИОДА(РаботникиОрганизаций.Период, МЕСЯЦ) = &ТекущийПериод
	|
	|) КАК Работники
	|ПО Перерасчеты.Сотрудник = Работники.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеНаименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументыМассив = мПодразделенияДокументы.Получить(Выборка.Подразделение);
		Если ДокументыМассив = НеОпределено Тогда
			ДокументыМассив = Новый Массив;
			ДокументыМассив.Добавить(Выборка.Документ);
			мПодразделенияДокументы[Выборка.Подразделение] = ДокументыМассив;
			Строка = СписокПодразделений.Добавить();
			Строка.Подразделение = Выборка.Подразделение;
			Строка.ПодразделениеНаименование = Выборка.ПодразделениеНаименование;
		Иначе
			ДокументыМассив.Добавить(Выборка.Документ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// заполняет табличную часть СписокРаботников и соответсвие мРаботникиДокументы 
// предназначенные для выполнения команды "отметить по подразделениям"
Процедура ЗаполнитьСписокРаботников() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТекущийПериод", ТекущийПериод);
	Запрос.УстановитьПараметр("Организация", Организация);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Перерасчет.Сотрудник КАК Сотрудник,
	|	Перерасчет.Сотрудник.Наименование КАК СотрудникНаименование,
	|	Перерасчет.ОбъектПерерасчета КАК Документ
	|ИЗ
	|	РегистрРасчета.Начисления.ПерерасчетНачислений КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	//*?|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перерасчет.Сотрудник,
	|	Перерасчет.Сотрудник.Наименование,
	|	Перерасчет.ОбъектПерерасчета
	|ИЗ
	|	РегистрРасчета.ВзносыВФонды.ПерерасчетВзносовВФонды КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	//*?|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перерасчет.Сотрудник,
	|	Перерасчет.Сотрудник.Наименование,
	|	Перерасчет.ОбъектПерерасчета
	|ИЗ
	|	РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	//*?|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументыМассив = мРаботникиДокументы.Получить(Выборка.Сотрудник);
		Если ДокументыМассив = НеОпределено Тогда
			ДокументыМассив = Новый Массив;
			ДокументыМассив.Добавить(Выборка.Документ);
			мРаботникиДокументы[Выборка.Сотрудник] = ДокументыМассив;
			Строка = СписокРаботников.Добавить();
			Строка.Работник = Выборка.Сотрудник;
			Строка.РаботникНаименование = Выборка.СотрудникНаименование;
		Иначе
			ДокументыМассив.Добавить(Выборка.Документ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

мПодразделенияДокументы = Новый Соответствие;
мРаботникиДокументы = Новый Соответствие;
